viktorthewinner/summer_school_nxp/distributed_ecu/__repo__/frdmmcxa153/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_IBE_ibe0 0x00u          /*!<@brief Input Buffer Enable: Disables */
#define PCR_IBE_ibe1 0x01u          /*!<@brief Input Buffer Enable: Enables */
#define PCR_PE_pe1 0x01u            /*!<@brief Pull Enable: Enables */
#define PCR_PS_ps1 0x01u            /*!<@brief Pull Select: Enables internal pullup resistor */
#define PORT1_PCR0_MUX_mux10 0x02u  /*!<@brief Pin Multiplex Control: Alternative 2 (chip-specific) */
#define PORT1_PCR1_MUX_mux10 0x02u  /*!<@brief Pin Multiplex Control: Alternative 2 (chip-specific) */
#define PORT1_PCR3_MUX_mux10 0x02u  /*!<@brief Pin Multiplex Control: Alternative 2 (chip-specific) */
#define PORT3_PCR29_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*! @name PORT3_12 (number 38), LED_RED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_RED_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_RED_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_LED_RED_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_LED_RED_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED_RED_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_RED_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_RED_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT1_7 (number 1), SW3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SW3_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SW3_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SW3_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SW3_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SW3_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SW3_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT3_0 (number 46), LED_BLUE_PWM
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED_BLUE_PWM_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_BLUE_PWM_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_BLUE_PWM_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT3_29 (number 32), SW2_ADC
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SW2_ADC_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SW2_ADC_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SW2_ADC_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT1_4 (number 62), BOARD_ILI9341_DC_PIN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BOARD_ILI9341_DC_PIN_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BOARD_ILI9341_DC_PIN_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_BOARD_ILI9341_DC_PIN_GPIO_PIN 4U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_BOARD_ILI9341_DC_PIN_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_BOARD_ILI9341_DC_PIN_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BOARD_ILI9341_DC_PIN_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BOARD_ILI9341_DC_PIN_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PORT1_5 (number 63), BOARD_ILI9341_RST_PIN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BOARD_ILI9341_RST_PIN_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BOARD_ILI9341_RST_PIN_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_BOARD_ILI9341_RST_PIN_GPIO_PIN 5U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_BOARD_ILI9341_RST_PIN_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_BOARD_ILI9341_RST_PIN_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BOARD_ILI9341_RST_PIN_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BOARD_ILI9341_RST_PIN_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PORT1_6 (number 64), BOARD_ILI9341_BL_PIN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BOARD_ILI9341_BL_PIN_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BOARD_ILI9341_BL_PIN_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_BOARD_ILI9341_BL_PIN_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_BOARD_ILI9341_BL_PIN_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_BOARD_ILI9341_BL_PIN_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BOARD_ILI9341_BL_PIN_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BOARD_ILI9341_BL_PIN_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
